In [6]:
# Pandas를 이용한 데이터셋 관리 및 구축
> Numpy 기반의 라이브러리인 Pandas를 배워보고, 데이터셋을 구축해봅시다.

In [ ]:
### 1. 파일에서 데이터 불러오기
import pandas as pd
from _collections import OrderedDict
data_frame = pd.read_csv('friend_list.csv')
data_frame.head()
data_frame.head(3)
data_frame.tail()
data_frame.tail(3)

In [18]:
### 2. 데이터 프레임 생성, 저장하기

# 1.   딕셔너리
# 2.   콜렉션
# 3.   리스트

friend_dict_list = [
    {'name' : 'John', 'age' : 25, 'job' : 'student'},
    {'name' : 'Jenny', 'age' : 20, 'job' : 'developer'},
    {'name' : 'Nate', 'age' : 30, 'job' : 'teacher'}
]
df = pd.DataFrame(friend_dict_list)
df

    name  age        job
0   John   25    student
1  Jenny   20  developer
2   Nate   30    teacher

In [19]:
friend_ordered_list = (
    [
        ('name', ['John', 'Nate']),
        ('age', [25, 30]),
        ('job', ['student', 'teacher'])
    ]
)
df = pd.DataFrame(friend_ordered_list)
df

      0                   1
0  name        [John, Nate]
1   age            [25, 30]
2   job  [student, teacher]

In [10]:
friend_list = [
    ['John', 25, 'student'],
    ['Nate', 30, 'teacher']
]
column_name = ['name', 'age', 'job']
df = pd.DataFrame.from_records(friend_list,columns = column_name)
df

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [26]:
friend_list = [
    {'name' : 'John', 'age' : 25, 'job' : 'student'},
    {'name' : 'Jenny', 'age' : 20, 'job' : 'developer'},
    {'name' : 'Nate', 'age' : 30, 'job' : 'teacher'}
]
df = pd.DataFrame(friend_list)
df.to_csv('friends.csv')

In [30]:
### 3. 데이터 행,열 선택 및 필터 하기
df = pd.DataFrame(friend_dict_list)
df.loc[ [0,2] ]

   name  age      job
0  John   25  student
2  Nate   30  teacher

In [33]:
df[df.age>20]

   name  age      job
0  John   25  student
2  Nate   30  teacher

In [31]:
df[ (df.age>20) & (df.name == 'Nate') ]

   name  age      job
2  Nate   30  teacher

In [35]:
#### 3.2 데이터 행, 열 필터링
friend_list = [
    ['John', 20, 'student'],
    ['Jenny', 30, 'developer'],
    ['Nate', 30, 'teacher'],
]
df = pd.DataFrame.from_records(friend_list)
df.iloc[:, 0:2]

       0   1
0   John  20
1  Jenny  30
2   Nate  30

In [37]:
df = pd.read_csv('friend_list.csv')
df_filtered = df[['name', 'age']]
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [38]:
df.filter(items=['age', 'job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [39]:
df.filter(like='a', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [41]:
### 4. 데이터프레임 행,열 생성 및 수정하기
df = pd.DataFrame(friend_dict_list)
df['salary'] = 0
df

    name  age        job  salary
0   John   25    student       0
1  Jenny   20  developer       0
2   Nate   30    teacher       0

In [42]:
import numpy as np
df['salary'] = np.where(df['job'] != 'student', 'yes', 'no')
df

    name  age        job salary
0   John   25    student     no
1  Jenny   20  developer    yes
2   Nate   30    teacher    yes

In [43]:
friend_test_list = [
    {'name' : 'John', 'midterm' : 90, 'final' : 95},
    {'name' : 'Jenny', 'midterm' : 70, 'final' : 75},
    {'name' : 'Nate', 'midterm' : 30, 'final' : 50}
]
df = pd.DataFrame(friend_test_list)
df

    name  midterm  final
0   John       90     95
1  Jenny       70     75
2   Nate       30     50

In [44]:
df['total'] = df['midterm'] + df['final']
df

    name  midterm  final  total
0   John       90     95    185
1  Jenny       70     75    145
2   Nate       30     50     80

In [45]:
df['average'] = df['total'] / 2
df

    name  midterm  final  total  average
0   John       90     95    185     92.5
1  Jenny       70     75    145     72.5
2   Nate       30     50     80     40.0

In [46]:
grade = []
for row in df['average'] :
    if row >= 90 :
        grade.append('A')
    elif row >= 70 :
        grade.append('B')
    else :
        grade.append('F')
df['grade'] = grade
df

    name  midterm  final  total  average grade
0   John       90     95    185     92.5     A
1  Jenny       70     75    145     72.5     B
2   Nate       30     50     80     40.0     F

In [47]:
def pass_or_fail(row) :
    if row != 'F' :
        return 'Pass'
    else :
        return 'Fail'
df.grade = df.grade.apply(pass_or_fail)
df

    name  midterm  final  total  average grade
0   John       90     95    185     92.5  Pass
1  Jenny       70     75    145     72.5  Pass
2   Nate       30     50     80     40.0  Fail

In [48]:
date_list = [
    {
        'yyyy-mm-dd' : '2002-05-31'
    },
    {
        'yyyy-mm-dd' : '2010-06-27'
    }
]
df = pd.DataFrame(date_list, columns=['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2002-05-31
1  2010-06-27

In [49]:
def extract_year (row) :
    return row.split('-')[0]
df['yyyy-mm-dd'] = df['yyyy-mm-dd'].apply(extract_year)
df

  yyyy-mm-dd
0       2002
1       2010

In [50]:
### 5. 데이터프레임 행,열 삭제하기
friends = [
    {'age' : 15, 'job' : 'student'},
    {'age' : 25, 'job' : 'developer'},
    {'age' : 30, 'job' : 'teacher'},
]
df = pd.DataFrame(friends, index=['John', 'Jenny', 'Nate'], columns=['age', 'job'])
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [51]:
df.drop(['John', 'Nate'])

       age        job
Jenny   25  developer

In [52]:
df = df.drop(['John', 'Nate'])
df

       age        job
Jenny   25  developer

In [53]:
df = pd.DataFrame(friends, index=['John', 'Jenny', 'Nate'], columns=['age', 'job'])
df.drop(['John', 'Nate'], inplace=True)
df

       age        job
Jenny   25  developer

In [56]:
friend_list = [
    {'name' : 'John', 'age' : 25, 'job' : 'student'},
    {'name' : 'Jenny', 'age' : 20, 'job' : 'developer'},
    {'name' : 'Nate', 'age' : 30, 'job' : 'teacher'}
]
df = pd.DataFrame(friend_list, columns=['name', 'age', 'job'])
df = df.drop(df.index[ [0,2] ])
df

    name  age        job
1  Jenny   20  developer

In [58]:
df = pd.DataFrame(friend_list, columns=['name', 'age', 'job'])
df = df[df.age > 20]
df

   name  age      job
0  John   25  student
2  Nate   30  teacher

In [59]:
df = pd.DataFrame(friend_list, columns=['name', 'age', 'job'])
df = df.drop('age', axis=1)
df

    name        job
0   John    student
1  Jenny  developer
2   Nate    teacher

In [62]:
df = pd.DataFrame(friend_list, columns=['name', 'age', 'job'])
df.drop('age', axis=1, inplace=True)
df

    name        job
0   John    student
1  Jenny  developer
2   Nate    teacher

In [63]:
### 6. 데이터 그룹 만들기
student_list = [
        {'name': 'John', 'major': "Computer Science", 'sex': "male"},
        {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
        {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
        {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
        {'name': 'Janny', 'major': "Economics", 'sex': "female"},
        {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
        {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
        {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
        {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
        {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
        {'name': 'Sera', 'major': "Psychology", 'sex': "female"}
]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [64]:
groupby_major = df.groupby('major')
groupby_major.groups

{'Computer Science': Int64Index([0, 1, 6, 7], dtype='int64'),
 'Economics': Int64Index([4, 5, 9], dtype='int64'),
 'Physics': Int64Index([2], dtype='int64'),
 'Psychology': Int64Index([3, 8, 10], dtype='int64')}

In [65]:
for name, group in groupby_major :
    print(name + " : " + str(len(group)))
    print(group)
    print()

Computer Science : 4
       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male

Economics : 3
    name      major     sex
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female

Physics : 1
      name    major   sex
2  Abraham  Physics  male

Psychology : 3
     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

In [66]:
df_mafor_cnt = pd.DataFrame( {'count' : groupby_major.size()}).reset_index()
df_mafor_cnt

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [67]:
groupby_sex = df.groupby('sex')
for name, group in groupby_sex :
    print(name + " : " + str(len(group)))
    print(group)
    print()

female : 6
        name             major     sex
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

male : 5
      name             major   sex
0     John  Computer Science  male
1     Nate  Computer Science  male
2  Abraham           Physics  male
3    Brian        Psychology  male
7   Edward  Computer Science  male

In [68]:
### 7. 다양한 함수 써보기
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [69]:
def extract_year(row) :
    return row.split('-')[0]
df['year'] = df['yyyy-mm-dd'].map(extract_year)
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [70]:
job_list = [{'age': 20, 'job': 'student'},
         {'age': 30, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(job_list)
df

   age        job
0   20    student
1   30  developer
2   30    teacher

In [71]:
df.job = df.job.map({"student":1,"developer":2,"teacher":3})
df

   age  job
0   20    1
1   30    2
2   30    3

In [73]:
x_y = [{'x': 5.5, 'y': -5.6},
         {'x': -5.2, 'y': 5.5},
         {'x': -1.6, 'y': -4.5}]
df = pd.DataFrame(x_y)
df

     x    y
0  5.5 -5.6
1 -5.2  5.5
2 -1.6 -4.5

In [74]:
df = df.applymap(np.around)
df

     x    y
0  6.0 -6.0
1 -5.0  6.0
2 -2.0 -4.0

In [75]:
job_list = [{'name': 'John', 'job': "teacher"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Fred', 'job': "teacher"},
                {'name': 'Abraham', 'job': "student"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Janny', 'job': "developer"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Obrian', 'job': "dentist"},
                {'name': 'Yuna', 'job': "teacher"},
                {'name': 'Rob', 'job': "lawyer"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Matt', 'job': "student"},
                {'name': 'Wendy', 'job': "banker"},
                {'name': 'Edward', 'job': "teacher"},
                {'name': 'Ian', 'job': "teacher"},
                {'name': 'Chris', 'job': "banker"},
                {'name': 'Philip', 'job': "lawyer"},
                {'name': 'Janny', 'job': "basketball player"},
                {'name': 'Gwen', 'job': "teacher"},
                {'name': 'Jessy', 'job': "student"}
         ]
df = pd.DataFrame(job_list, columns = ['name', 'job'])
df

       name                job
0      John            teacher
1      Nate            teacher
2      Fred            teacher
3   Abraham            student
4     Brian            student
5     Janny          developer
6      Nate            teacher
7    Obrian            dentist
8      Yuna            teacher
9       Rob             lawyer
10    Brian            student
11     Matt            student
12    Wendy             banker
13   Edward            teacher
14      Ian            teacher
15    Chris             banker
16   Philip             lawyer
17    Janny  basketball player
18     Gwen            teacher
19    Jessy            student

In [76]:
df.job.unique()

array(['teacher', 'student', 'developer', 'dentist', 'lawyer', 'banker',
       'basketball player'], dtype=object)

In [77]:
df.job.value_counts()

teacher              8
student              5
banker               2
lawyer               2
dentist              1
developer            1
basketball player    1
Name: job, dtype: int64

In [78]:
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l2 = [{'name': 'Ed', 'job': "dentist"},
      {'name': 'Jack', 'job': "farmer"},
      {'name': 'Ted', 'job': "designer"}]

df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])
frames = [df1, df2]
result = pd.concat(frames, ignore_index=True)
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [80]:
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Jack', 'job': "developer"}]

l2 = [{'age': 25, 'country': "U.S"},
      {'age': 30, 'country': "U.K"},
      {'age': 45, 'country': "Korea"}]

df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['age', 'country'])
result = pd.concat([df1, df2], axis=1, ignore_index=True)
result

      0          1   2      3
0  John    teacher  25    U.S
1  Nate    student  30    U.K
2  Jack  developer  45  Korea